{
    "definitions": {
      "contract": "A legally binding agreement between two or more parties.  A contract requires an offer, acceptance, and consideration (something of value exchanged).",
      "negligence": "Failure to exercise reasonable care, which results in damage or injury to another person.  Negligence requires a duty of care, a breach of that duty, causation (the breach caused the harm), and damages (actual harm).",
      "breach of contract": "Failure to fulfill the terms of a contract.  A breach can be material (significant) or minor (less important).  Remedies for breach of contract can include monetary damages or specific performance (requiring the breaching party to fulfill their obligations).",
      "tort": "A civil wrong that causes harm to another person.  Torts can be intentional (e.g., assault) or unintentional (e.g., negligence).",
      "jurisdiction": "The geographical area over which a court or other authority has the power to apply laws or make judgments.",
      "plaintiff": "The person who brings a case against another in a court of law.",
      "defendant": "An individual or group being sued or charged with a crime.",
      "statute": "A written law passed by a legislative body.",
      "regulation": "A rule or directive made and maintained by an authority.",
      "precedent": "A legal principle or rule established by a court in a previous case that can be used as the basis for a decision in a similar case.",
      "due process": "Fair treatment through the normal judicial system established by law.",
      "burden of proof": "The obligation to prove one's assertion.",
      "evidence": "Testimony, documents, or objects used to prove or disprove a fact in a legal case.",
      "injunction": "A judicial order that requires a person to do, or refrain from doing, a particular act.",
      "damages": "Monetary compensation awarded to a party who has suffered injury or loss.",
      "liability": "Legal responsibility for one's actions or omissions.",
      "arbitration": "A form of alternative dispute resolution where a neutral third party (arbitrator) hears both sides of a dispute and makes a binding decision.",
      "mediation": "A process where a neutral third party (mediator) helps parties in a dispute communicate and negotiate to reach a mutually acceptable agreement.",
      "legal advice": "Professional guidance provided by a lawyer on legal matters.  *Disclaimer: This chatbot does not provide legal advice.*",
      "legal representation": "Hiring a lawyer to represent someone in a legal matter.",
      "cause of action": "A set of facts that gives rise to a legal claim.",
      "remedy": "The relief that a court can grant to a party who has been harmed.",
      "discovery": "The pre-trial process where parties exchange information and evidence relevant to the case.",
      "summary judgment": "A judgment entered by a court for one party without a trial, if there are no disputed material facts and one party is entitled to judgment as a matter of law.",
      "appeal": "A request to a higher court to review the decision of a lower court.",
      "amicus curiae": "A friend of the court who submits information to the court for consideration.",
      "pro bono": "Legal services provided for free or at a reduced cost to those who cannot afford them.",
      "res judicata": "A matter already judged.",
      "stare decisis": "To stand by things decided.",
      "ultra vires": "Acting beyond one's legal power or authority.",
      "void": "Having no legal force or effect.",
      "voidable": "Capable of being made void.",
      "waiver": "The intentional relinquishment or abandonment of a known right or privilege.",
      "estoppel": "A legal principle that prevents someone from denying or withdrawing something previously said or agreed upon.",
      "hearsay": "Out-of-court statements offered in court as evidence to prove the truth of the matter asserted.",
      "best evidence rule": "A rule requiring that the original writing, recording, or photograph be produced in court unless it is unavailable.",
      "burden of persuasion": "The party who has to convince the fact-finder to decide the disputed facts in that party's favor.",
      "clear and convincing evidence": "A higher standard of proof than preponderance of the evidence, but lower than proof beyond a reasonable doubt.",
      "preponderance of the evidence": "The greater weight of the evidence; more likely than not.",
      "beyond a reasonable doubt": "The highest standard of proof, used in criminal cases.",
      "double jeopardy": "Being prosecuted twice for the same offense.",
      "mens rea": "Criminal intent.",
      "actus reus": "A criminal act.",
      "misdemeanor": "A less serious crime than a felony.",
      "felony": "A serious crime punishable by imprisonment for more than one year.",
      "probation": "A sentence that allows an offender to remain in the community under supervision.",
      "parole": "The supervised release of a prisoner before the end of their sentence.",
      "mitigating circumstances": "Factors that make a crime less severe.",
      "aggravating circumstances": "Factors that make a crime more severe."
    }
  }